Revit 2026 API

# CommonSharedAssetType Enumeration

---

The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CommonSharedAssetType
```
```vb
Public Enumeration CommonSharedAssetType
```
```cpp
public enum class CommonSharedAssetType
```
```fsharp
type CommonSharedAssetType
```

| Member name | Value | Description |
| --- | --- | --- |
| Independent | 1 |  |
| Shared | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace